[Killed] StringLiteral
sd-022-b-project-react-testing-library/src/components/PokemonButtonsPanel.js:24:14
             onClick={ () => filterPokemons(type) }
             className="filter-button"
           >
-            {`${type}`}
+            {""}
           </Button>
         ))}
